# Pandas Practise

## Series

In [1]:
#A series can have an indexed labelled with axis, that differentiates it from numpy arrays

In [2]:
import numpy as np
import pandas as pd

### Creating a Series

In [3]:
label = ['a','b','c'] #python list
my_data = [10,20,30] #python list
arr = np.array(my_data) #numpy array
dictionary = {'a':10,'b':20,'c':30} #python dictionary

#### From Python List to Series

In [4]:
pd.Series(data = my_data) #the first column is the index column
#in pandas you can specify what you want that index to be

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_data, index=label) #python list --> Series
#this changes the index from 0,1,2 to a,b,c you can call the value using 
#the index
#the index parameter takes in a python list

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,label) #dont need to actually write 'data=' or 'index='
#as long as you put them in the correct order

a    10
b    20
c    30
dtype: int64

#### From NumPy Array to Series

In [7]:
pd.Series(arr) #numpy array --> Series

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(arr,label) #works the same way as python list when it comes to converting

a    10
b    20
c    30
dtype: int32

#### Form Dictionary to Series

In [9]:
dictionary

{'a': 10, 'b': 20, 'c': 30}

In [10]:
pd.Series(dictionary) #dictionary --> Series
#automatically takes the keys as the index and the values as the value in 
#the Series

a    10
b    20
c    30
dtype: int64

In [11]:
#panda series can hold a variety of object types
pd.Series(label)

0    a
1    b
2    c
dtype: object

#### Sidenote: Having Built-in Functions as elements of a Series

In [12]:
pd.Series(data=[sum,print,len]) #built-in functions being elements of a Series

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Indexing

In [13]:
#Using the Index
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [14]:
ser1 #the indexes are the country names and teh values are the 1,2,3,4

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [16]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [17]:
ser1['USA']

1

In [18]:
ser3 = pd.Series(data=label)

In [19]:
ser3

0    a
1    b
2    c
dtype: object

In [20]:
ser3[0]

'a'

### Operations on Series

In [21]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [22]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [23]:
ser1 + ser2 #adds both the value where the index are the same
#if it cannot find a match of the indexes, it puts a NaN value
#when you carry out operations in numpy or series, integers are gg to be 
#converted to floats in order to retain all the info possible.

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames

In [24]:
#DataFrames are a bunch of series which share a common index that are grouped together.
#Both the rows and columns are series.

### Creating DataFrames from Scratch

In [25]:
from numpy.random import randn

In [26]:
np.random.seed(101) #to get the same random numbers

In [27]:
df = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=["W","X","Y","Z"])

In [28]:
df #each of the columns are a panda series and all of them share a common index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selecting Columns

#### Using the [ ] Method (Recommended)

In [29]:
df["W"] #this is a series
#way to grab a series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
type(df["W"])

pandas.core.series.Series

In [31]:
type(df) #therefore, a dataframe is a bunch of series

pandas.core.frame.DataFrame

In [32]:
df[["W","Z"]] #you get a dataframe, when you ask for more than 1 series, and
#when you put double []
#when you call for 1 column then you get a series

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [33]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [34]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

#### Using the df.column_name method (Not Recommended at all)

In [35]:
df.W #another way to grab a series, but pandas can get confused between the 
#methods or the column, so stick to the [ notation]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

### Selecting Rows

In [36]:
#selecting rows
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Using loc Method

In [37]:
df.loc['A'] #Selecting rows, the rows are also series, not just the columns

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [38]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

#### Using iloc method

In [39]:
df.iloc[2] #use iloc to pass in a numerical index position even if axes are named after string

#use loc if you want to write the same as what the index is
#use iloc, the value inside the [] can only be integer

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [40]:
df.loc['B','Y'] #returns a single value

-0.8480769834036315

In [41]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Insterting New Columns

In [42]:
#creating a new column
df['new'] = df['W'] + df['Y'] #pretend like it already exists and code for it

In [43]:
df #new column is added to the df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### Dropping Columns

In [44]:
df.drop('new',axis=1) #must mention the axis otherwise you get an error if you 
#want to remove the columns as the default axis is 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df #the new column is still there as the dropping does not happen inplace, 
#and the df is actually not affected, if you dont put inplace as True

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [46]:
df.drop('new',axis=1,inplace=True) #inplace is by default set to False to 
#prevent losing data, but you need to turn it to True

In [47]:
df #now the column 'new' is no longer there in the df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df.drop('E') #dont need to write axis=0 as it is by default 0
#purposely kept inplace as False

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [49]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df.shape #is a tuple, row = 0 and col = 1 for indexing as it is directly 
#taken form the shape

(5, 4)

### Conditional Selection

#### Single Condition

In [51]:
#conditional Selection 
df > 0 #returns a df of boolean values

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [52]:
booldf = df > 0

In [53]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [55]:
df[booldf] #would return a df where the values for true are given and the rest is false

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
#usually wouldnt separate it out inot 2 steps, you would mix it in one step
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df['W']> #you get a series which is linked to an actual index

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [61]:
df[df['W']>0] #returns a df where only the rows where W>0 is returned

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
resultsdf = df[df['W']>0] #resultsdf is a df where all the values of W are positive

In [63]:
resultsdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
resultsdf['X']  #grabbing the X column when all W values are positive

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [65]:
#combining all into 1 step
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [72]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [76]:
boolser = df['W']>0 #picks out the rows where W>0
result = df[boolser] #converted the bool values to actual numbers/values in a df 
my_cols = ['Y','X'] #column names in a python list

In [77]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [78]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
result[my_cols] #OR results[['Y','X']] also works

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

#### Multiple Conditions

In [84]:
#multiple conditions
#df[(df['W']>0) and (df['Y']>1)] would give you an error it would say the truth value of a series is ambiguous
#which means python normal and operator does not compare series with other series. 
#it can only take in single boolean values at a time! therefore, instead you should use &, |(or) etc.

df[(df['W']>0) & (df['Y']>1)] 

#this filters out the row E where both the conditions are true

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

### Basic Indexing

#### Resetting Index

In [85]:
#index 
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
#resetting the index back to default
df.reset_index()
#the prev index would be returned as a column, then you would have to drop i

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [89]:
df #if you want the change in index to be permanent rmbr to turn inplace on

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Setting a column as the Index

In [92]:
newind = 'CA NY Y OR CO'.split() #new way to create a list

In [93]:
newind

['CA', 'NY', 'Y', 'OR', 'CO']

In [94]:
df['States'] = newind

In [96]:
df #adding a new column in df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001      Y
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [97]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
Y      -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [99]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001      Y
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

### Multi-Level Indexing

In [100]:
#Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #the zip along with the list function
#combines 2 lists' value to make a pair

In [101]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [102]:
hier_index = pd.MultiIndex.from_tuples(hier_index) 
#takes in a list that looks like the above cell and creates levels of 
#multiindex from it

In [105]:
hier_index #codes are the labels

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [110]:
df = pd.DataFrame(data=randn(6,2),index=hier_index,columns=['A','B'])

In [111]:
df #df with multilevel index

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

### Selection from Multi-Level Index DataFrame

#### Using .loc or .iloc method

In [112]:
df.loc['G1'] #gets everything in G1

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [115]:
df.loc['G1'].loc[1] #get a series 
#for the second loc, you can use .iloc too as the value inside the [] is an integer
#basic idea is to start from the outermost index and go inwards

A    0.302665
B    1.693723
Name: 1, dtype: float64

##### Giving Titles to Indexes

In [116]:
#to name the index (the 2 cells to the left of A)
df.index.names
#the output is a none as those 2 cells are not yet named, ie the title of 
#the index

FrozenList([None, None])

In [117]:
df.index.names = ['Groups','Num']

In [119]:
df.index.names

FrozenList(['Groups', 'Num'])

In [120]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [123]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

#### Using the cross-section method (.xs)

In [124]:
#cross-section used on multilevel index df
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [125]:
df.xs('G1')  # .xs has the ability to skip/go inside the subsection

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [126]:
df.xs(1,level='Num') #get the value when num = 1 regardless of the Groups

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

### Missing Data

In [128]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [129]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [130]:
df = pd.DataFrame(d)

In [131]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Using .dropna()

In [133]:
df.dropna() #without any parameters, only default function would result in 
#pandas dropping any row, as long as there is 1 NaN Value in that row

     A    B  C
0  1.0  5.0  1

In [134]:
df.dropna(axis=1) #drops any column as long as they have null values

   C
0  1
1  2
2  3

In [135]:
df.dropna(thresh=2)
#drops any rows where there are 2 or more NaN values present

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

#### Using .fillna() method

In [136]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [139]:
df.fillna(value='FILL VALUE') #all Nan Values get filled in with the value specified

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [144]:
df['A'].fillna(value=df['A'].mean()) #fills in the nan value with the mean

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

In [145]:
#groupby allows you to group togther rows based off of a column and perform
#an aggregate fxn - which is any fxn that takes in a bunch of input values
#and returns an output fxn

In [146]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','my','Vanessa','Carl','Sarah'],
       'Sales': [200,120,340,124,243,350]}

In [147]:
df = pd.DataFrame(data=data)

In [148]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      my    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [150]:
#group by company
by_comp = df.groupby('Company')

In [152]:
by_comp #only shows where it is stored

In [153]:
by_comp.mean() #a new df returned

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [154]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [155]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [157]:
by_comp.sum().loc['FB'] #gives you the sales sum of FB

Sales    593
Name: FB, dtype: int64

In [158]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [160]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [163]:
df.groupby("Company").max()

        Person  Sales
Company
FB       Sarah    350
GOOG       Sam    200
MSFT       my    340

In [166]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [167]:
df.groupby("Company").describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### Merging, Joining and Concatenation

In [168]:
#refer to the notebook that was given for concatenation

In [216]:
list1 = "a,b,c,d,e,f" .split(sep=",")

In [217]:
list1

['a', 'b', 'c', 'd', 'e', 'f']

In [218]:
df_list1 = pd.DataFrame(data=list1)

In [219]:
df_list1

   0
0  a
1  b
2  c
3  d
4  e
5  f

In [220]:
num = [0,1,2,3,4,5]

In [221]:
df_list1["key"] = num

In [222]:
df_list1

   0  key
0  a    0
1  b    1
2  c    2
3  d    3
4  e    4
5  f    5

#### Merging

In [223]:
df

  Company   Person  Sales  key
0    GOOG      Sam    200    0
1    GOOG  Charlie    120    1
2    MSFT      my    340    2
3    MSFT  Vanessa    124    3
4      FB     Carl    243    4
5      FB    Sarah    350    5

In [224]:
num = [0,1,2,3,4,5]

In [225]:
df["key"] = num

In [226]:
df

  Company   Person  Sales  key
0    GOOG      Sam    200    0
1    GOOG  Charlie    120    1
2    MSFT      my    340    2
3    MSFT  Vanessa    124    3
4      FB     Carl    243    4
5      FB    Sarah    350    5

In [227]:
pd.merge(df,df_list1,on="key")
#idea is that there are 2 columns that are the same in both the 
#dataframes, so the dataframes would merge at the identical 
#column.

  Company   Person  Sales  key  0
0    GOOG      Sam    200    0  a
1    GOOG  Charlie    120    1  b
2    MSFT      my    340    2  c
3    MSFT  Vanessa    124    3  d
4      FB     Carl    243    4  e
5      FB    Sarah    350    5  f

In [228]:
#you can merge on multiple keys, just provide more names

#### Join

In [229]:
#combine 2 columns which are differently indexed into a single result 
#dataframe

In [232]:
#df.join(df_list1) #doesnt work as all the naming of the columns are the same

### Operations

In [238]:
df = pd.DataFrame({"col1":[1,2,3,4],
                  "col2":[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Unique Values

In [243]:
df['col2'].unique() #finding the unique values

array([444, 555, 666], dtype=int64)

In [249]:
df['col2'].value_counts() #returns how many times each unique value occurred

444    2
555    1
666    1
Name: col2, dtype: int64

#### Finding how many Unique Values

In [247]:
len(df['col2'].unique()) #finding how many unique values

3

In [248]:
df['col2'].nunique()  #finding how many unique values

3

#### Recap on Conditional Selection

In [250]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

#### Applying Functions to DataFrames

In [251]:
#defining your own function
def times2(x):
    return x*2

In [252]:
df['col1'].sum()

10

In [253]:
df['col1'].apply(times2) #applying your own fxn into a df WOWOW

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [255]:
df['col3'].apply(len) #.apply can be used for built-in fxns too

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [259]:
df['col2'].apply(lambda x: x*2) #.apply can alos be used for lambda

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

#### Dropping Columns

In [260]:
#dropping columns
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [261]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Getting Information

##### On Columns

In [262]:
#getting to know the columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

##### On Indexes

In [263]:
#gives info abt the index
df.index

RangeIndex(start=0, stop=4, step=1)

#### Sorting Values

In [265]:
df.sort_values(by='col2') #col2 is sorted in ascending order 
#note how the index stays attached ot the row, and now it is 0,3,1,2 and 
#not 0,1,2,3 as it was previously

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

#### Null Values

In [266]:
#finding null values
df.isnull() #gives a bool df

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

#### Pivot Tables

In [267]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data=data)

In [268]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [270]:
#pivot table, a multi-index out of the existing df
df.pivot_table(values='D',index=['A','B'],columns=['C'])
#there are some nan values as there were some values which did not match ,
#for eg there is no value for bar 2 x in the above cell

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input and Output

In [271]:
pwd #reports the location

'C:\\Users\\Sankeerthana\\Google Drive\\Learning\\Udemy'

#### CSV to Df

In [273]:
#pd.read_(plress tab to see all the options, its alot incl sql too)

#### Df to CSV

In [274]:
#if you want to convert certain df to a csv file then type
#df.to_csv("My output",index=False), index=False if you dont waant the 
#index to be a separate column

In [275]:
#pandas cannot import formaula or images form excel files

#### Creating SQL Tables

In [276]:
from sqlalchemy import create_engine

In [285]:
engine = create_engine("sqlite:///:memory:") #creating a temporary 
#sqlite database in memory

In [286]:
df.to_sql("my_table",engine)

In [287]:
sqldf = pd.read_sql("my_table",con=engine)

In [288]:
sqldf, #index is a new column here

   index    A    B  C  D
0      0  foo  one  x  1
1      1  foo  one  y  3
2      2  foo  two  x  2
3      3  bar  two  y  5
4      4  bar  one  x  4
5      5  bar  one  y  1